{"config": [{"config": {"activation": "relu", "dilation_rate": [1, 1], "name": "conv2d_1", "strides": [2, 2], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 96, 96, 3], "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "padding": "valid", "dtype": "float32", "trainable": true, "kernel_size": [5, 5], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "activation": "relu", "name": "conv2d_2", "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "filters": 48, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "trainable": true, "kernel_size": [5, 5], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activation": "relu", "name": "conv2d_3", "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "trainable": true, "kernel_size": [5, 5], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "name": "dense_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 512, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "sigmoid", "name": "dense_2", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 70, "trainable": true, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}