{"backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["classification_subject", 0, 0], ["classification_object", 0, 0], ["classification_relationship", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 600]}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_1", "config": {"activity_regularizer": null, "dtype": "float32", "units": 1024, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "trainable": true, "batch_input_shape": [null, 600], "activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.01}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_1", "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"rate": 0.5, "seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "PriorProbability", "config": {"probability": 0.01}}, "kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "trainable": true, "units": 256, "activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.01}}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_2", "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"rate": 0.5, "seed": null, "name": "dropout_2", "noise_shape": null, "trainable": true}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_3", "bias_regularizer": null, "trainable": true, "units": 61, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_4", "bias_regularizer": null, "trainable": true, "units": 61, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "classification_subject", "config": {"name": "classification_subject", "activation": "softmax", "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "classification_object", "config": {"name": "classification_object", "activation": "softmax", "trainable": true}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": 1, "name": "concatenate_1", "trainable": true}, "inbound_nodes": [[["dropout_2", 0, 0, {}], ["classification_subject", 0, 0, {}], ["classification_object", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "PriorProbability", "config": {"probability": 0.01}}, "kernel_constraint": null, "name": "dense_5", "bias_regularizer": null, "trainable": true, "units": 128, "activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.01}}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_3", "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"rate": 0.5, "seed": null, "name": "dropout_3", "noise_shape": null, "trainable": true}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_6", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_6", "bias_regularizer": null, "trainable": true, "units": 10, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "classification_relationship", "config": {"name": "classification_relationship", "activation": "softmax", "trainable": true}, "inbound_nodes": [[["dense_6", 0, 0, {}]]]}], "name": "model_1"}, "keras_version": "2.2.4"}