{"backend": "tensorflow", "config": {"input_layers": [["input_4", 0, 0]], "name": "model_4", "layers": [{"inbound_nodes": [], "name": "input_4", "config": {"sparse": false, "batch_input_shape": [null, 600], "dtype": "float32", "name": "input_4"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "dense_18", "config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.01, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "name": "dense_18", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "batch_input_shape": [null, 600], "bias_constraint": null, "units": 1024}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_18", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"center": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "name": "batch_normalization_9", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "epsilon": 0.001, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "activation_9", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "dropout_9", "config": {"seed": null, "trainable": true, "noise_shape": null, "name": "dropout_9", "rate": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_9", 0, 0, {}]]], "name": "dense_19", "config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.01, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "name": "dense_19", "bias_initializer": {"config": {"probability": 0.01}, "class_name": "PriorProbability"}, "bias_constraint": null, "units": 256}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_19", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"center": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "name": "batch_normalization_10", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "epsilon": 0.001, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "dropout_10", "config": {"seed": null, "trainable": true, "noise_shape": null, "name": "dropout_10", "rate": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_10", 0, 0, {}]]], "name": "dense_20", "config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "name": "dense_20", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 61}, "class_name": "Dense"}, {"inbound_nodes": [[["dropout_10", 0, 0, {}]]], "name": "dense_21", "config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "name": "dense_21", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 61}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_20", 0, 0, {}]]], "name": "classification_subject", "config": {"name": "classification_subject", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}, {"inbound_nodes": [[["dense_21", 0, 0, {}]]], "name": "classification_object", "config": {"name": "classification_object", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}, {"inbound_nodes": [[["dropout_10", 0, 0, {}], ["classification_subject", 0, 0, {}], ["classification_object", 0, 0, {}]]], "name": "concatenate_3", "config": {"axis": 1, "trainable": true, "name": "concatenate_3"}, "class_name": "Concatenate"}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "dense_22", "config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.01, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "name": "dense_22", "bias_initializer": {"config": {"probability": 0.01}, "class_name": "PriorProbability"}, "bias_constraint": null, "units": 64}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_22", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"center": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "name": "batch_normalization_11", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "epsilon": 0.001, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "dropout_11", "config": {"seed": null, "trainable": true, "noise_shape": null, "name": "dropout_11", "rate": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_11", 0, 0, {}]]], "name": "dense_23", "config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "name": "dense_23", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 10}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_23", 0, 0, {}]]], "name": "classification_relationship", "config": {"name": "classification_relationship", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "output_layers": [["classification_subject", 0, 0], ["classification_object", 0, 0], ["classification_relationship", 0, 0]]}, "keras_version": "2.2.4", "class_name": "Model"}